Revit 2027 API
ExporterIFCUtils.GetLegacyStairOrRampComponents Method
 Gets the components of a stair or ramp.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCLegacyStairOrRamp GetLegacyStairOrRampComponents(
	ExporterIFC exporterIFC,
	Element element
)
Public Shared Function GetLegacyStairOrRampComponents (
	exporterIFC As ExporterIFC,
	element As Element
) As IFCLegacyStairOrRamp
public:
static IFCLegacyStairOrRamp^ GetLegacyStairOrRampComponents(
	ExporterIFC^ exporterIFC,
	Element^ element
)
static member GetLegacyStairOrRampComponents :
        exporterIFC : ExporterIFC *
        element : Element -> IFCLegacyStairOrRamp
Parameters
exporterIFC ExporterIFC
 The exporter.
element Element
 The legacy stair or ramp element.
Return Value
IFCLegacyStairOrRamp
 The LegacyStairOrRamp that contains the components. NULL means the components can't be determined.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace